Tekla Open API Reference for Tekla Structures 2025
AnalysisLocalCoordinateSystem Properties
The AnalysisLocalCoordinateSystem type exposes the following members.
Properties
Name | Description
LocalX
 The local X direction.
LocalY
 The local Y direction.
Top
See Also
Reference
AnalysisLocalCoordinateSystem Class
Tekla.Structures.Analysis Namespace